In [23]:
import pandas as pd 


data1={
    "name":["Saily","Mary","Jhon"],
    "age":[50,40,30]
}


data2={
    "qualified":[True,False,False],
    "age":[77,44,22]
}

df1=pd.DataFrame(data1)
df2=pd.DataFrame(data2)
print(df1)
print(df2)

    name  age
0  Saily   50
1   Mary   40
2   Jhon   30
   qualified  age
0       True   77
1      False   44
2      False   22

In [7]:
# to join dataframe

newdf=df1.join(df2)
print( newdf)

    name  age  qualified
0  Saily   50       True
1   Mary   40      False
2   Jhon   30      False

In [24]:
#to merge functiom 
newdf=df1.merge(df2,how="left")
print(newdf)

    name  age qualified
0  Saily   50       NaN
1   Mary   40       NaN
2   Jhon   30       NaN

In [31]:
# create a DataFrame

frame={
    "team":['A','B','C','D'],
    "points":[88,91,99,94],
    "assists":[22,28,30,31],
    "rebounds": [22,28,30,31]
}
df=pd.DataFrame(frame)
df

  team  points  assists  rebounds
0    A      88       22        22
1    B      91       28        28
2    C      99       30        30
3    D      94       31        31

In [32]:
#reshape DataFrame frame wide format to long 
df=pd.melt(df,id_vars="team",value_vars=['points','assists','rebounds'])
print(df)

   team  variable  value
0     A    points     88
1     B    points     91
2     C    points     99
3     D    points     94
4     A   assists     22
5     B   assists     28
6     C   assists     30
7     D   assists     31
8     A  rebounds     22
9     B  rebounds     28
10    C  rebounds     30
11    D  rebounds     31